print("    เลือกเมนูเพื่อทำรายการ")
print("##########################")
print("กด 1 เลือกเหมาจ่าย")
print("กด 2 เลือกจ่ายเพิ่ม")
a=int(input('เลือก :'))
if a==1:
    print("กรุณากรอกระยะทาง")
    b=int(input('ระยะทาง :'))
    if b <= 25 :
        print("ค่าใช้จ่ายรวมทั้งหมด 25 บาท",)
    elif b > 25 :
        print("ค่าใช้จ่ายรวมทั้งหมด 55 บาท")   
elif a==2 :
    print("ค่าเข้าแรก 25 บาท ถ้าระยะทาง25กิโลเมตรขึ้นไปจ่ายเพิ่ม 55 บาท")
    print("กรุณากรอกระยะทาง")
    b=int(input('ระยะทาง :'))
    if b <= 25 :
        print("ค่าใช้จ่ายรวมทั้งหมด 25 บาท",)
    elif b > 25 :
        print("ค่าใช้จ่ายรวมทั้งหมด 80 บาท")